Revit 2026 API

# FormattedTextGetListType Method

---

Returns the ListType of a paragraph.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ListType GetListType(
	TextRange textRange
)
```
```vb
Public Function GetListType (
	textRange As TextRange
) As ListType
```
```cpp
public:
ListType GetListType(
	TextRange^ textRange
)
```
```fsharp
member GetListType :
        textRange : TextRange -> ListType
```

#### Parameters

textRange TextRange
     The given text range.

#### Return Value

ListType The ListType of the paragraph.

| Exception | Condition |
| --- | --- |
| ArgumentException | This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text. |
| ArgumentNullException | A non-optional argument was null |

This function returns the list type of all paragraphs contained in the given range. Returns None if the paragraph is not in a list. Returns Mixed if the list types don't match between the paragraphs.

#### Reference

FormattedText Class

Autodesk.Revit.DB Namespace